a52dec
accounts-qml-module
accountsservice
acl
adobe-source-code-pro-fonts
adobe-source-han-sans-cn-fonts
adobe-source-han-sans-jp-fonts
adobe-source-han-sans-kr-fonts
adwaita-icon-theme
alsa-card-profiles
alsa-firmware
alsa-lib
alsa-plugins
alsa-topology-conf
alsa-ucm-conf
alsa-utils
amd-ucode
aom
appstream
appstream-glib
appstream-qt
archlinux-keyring
argon2
ark
at-spi2-atk
at-spi2-core
atk
atkmm
attica
attr
audacity
audiocd-kio
audit
autoconf
automake
avahi
b43-fwcutter
baloo
baloo-widgets
base
bash
bash-completion
bind
binutils
bison
bluez
bluez-libs
bluez-qt
boost-libs
box2d
breeze
breeze-gtk
breeze-icons
brotli
btrfs-progs
bubblewrap
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
cairomm
cantarell-fonts
cdparanoia
cfitsio
checkbashisms
chromaprint
cifs-utils
clucene
cmake
cmatrix
convertlit
coreutils
cracklib
cryptsetup
curl
dav1d
db
dbus
dbus-glib
dbus-python
dconf
desktop-file-utils
device-mapper
dhclient
dialog
diffutils
ding-libs
discount
djvulibre
dkms
dmenu
dmg2img
dmidecode
dmraid
dnsmasq
dnssec-anchors
dolphin
dosfstools
dotnet-host
dotnet-runtime
double-conversion
downgrade
dragon
duf
dunst
e2fsprogs
ebook-tools
editorconfig-core-c
efibootmgr
efitools
efivar
egl-wayland
eglexternalplatform
electron12
elisa
ell
enchant
ethtool
exfatprogs
exiv2
expat
extra-cmake-modules
f2fs-tools
faac
faad2
fakeroot
ffmpeg
ffmpeg4.4
ffmpegthumbnailer
fftw
file
filesystem
findutils
firefox
flac
flatpak
flex
fluidsynth
fontconfig
frameworkintegration
freeglut
freetype2
frei0r-plugins
fribidi
fsarchiver
fuse-common
fuse2
fuse3
fzf
gavl
gawk
gc
gcab
gcc
gcc-libs
gcr
gdbm
gdk-pixbuf2
geoclue
geocode-glib
geoip
geoip-database
gettext
ghostscript
giflib
git
glances
glew
glib-networking
glib2
glibc
glibmm
glslang
glu
gmp
gnome-desktop-4
gnome-desktop-common
gnome-disk-utility
gnome-keyring
gnu-netcat
gnupg
gnutls
gobject-introspection-runtime
gpgme
gpm
gptfdisk
graphene
graphite
grep
groff
grub
grub-tools
gsettings-desktop-schemas
gsl
gsm
gspell
gssdp
gssproxy
gst-libav
gst-plugin-pipewire
gst-plugins-bad
gst-plugins-bad-libs
gst-plugins-base
gst-plugins-base-libs
gst-plugins-ugly
gstreamer
gtk-update-icon-cache
gtk2
gtk3
gtk4
gtkmm
gtkmm3
gtksourceview3
guile
gupnp
gupnp-igd
gwenview
gzip
harfbuzz
harfbuzz-icu
haveged
hdparm
hicolor-icon-theme
hidapi
htop
hunspell
hwdata
hwdetect
hwinfo
hwloc
hyphen
i3-gaps
iana-etc
icu
ijs
imagemagick
imath
inetutils
iniparser
intltool
inxi
iproute2
iptables
iputils
ipw2100-fw
ipw2200-fw
iso-codes
iw
iwd
jansson
jasper
jbig2dec
jemalloc
jfsutils
jq
js78
json-c
json-glib
jsoncpp
kaccounts-integration
kactivities
kactivities-stats
kactivitymanagerd
karchive
kate
kauth
kazam
kbd
kbookmarks
kcalc
kcmutils
kcodecs
kcolorpicker
kcompletion
kconfig
kconfigwidgets
kcontacts
kcoreaddons
kcrash
kdbusaddons
kde-cli-tools
kde-gtk-config
kdeclarative
kdeconnect
kdecoration
kded
kdelibs4support
kdenlive
kdeplasma-addons
kdesu
kdnssd
kdsoap
kdsoap-ws-discovery-client
kemoticons
keyutils
kfilemetadata
kglobalaccel
kguiaddons
kholidays
khotkeys
ki18n
kiconthemes
kidletime
kimageannotator
kinfocenter
kinit
kio
kio-extras
kio-fuse
kirigami2
kitemmodels
kitemviews
kitty
kitty-shell-integration
kitty-terminfo
kjobwidgets
kjs
kmenuedit
kmod
knewstuff
knotifications
knotifyconfig
kpackage
kparts
kpeople
kpeoplevcard
kpty
kquickcharts
krb5
krita
krunner
kscreen
kscreenlocker
kservice
ksystemstats
ktexteditor
ktextwidgets
ktorrent
kunitconversion
kuserfeedback
kwallet
kwallet-pam
kwayland
kwayland-server
kwidgetsaddons
kwin
kwindowsystem
kxmlgui
l-smash
lame
layer-shell-qt
lcms2
ldb
ldns
less
libabw
libaccounts-glib
libaccounts-qt
libadwaita
libaio
libarchive
libass
libassuan
libasyncns
libatasmart
libatomic_ops
libavc1394
libavtp
libb2
libblockdev
libbluray
libbpf
libbs2b
libbsd
libbytesize
libcanberra
libcap
libcap-ng
libcddb
libcdio
libcdr
libcloudproviders
libcolord
libconfig
libcups
libdaemon
libdatrie
libdbusmenu-qt5
libdc1394
libdca
libde265
libdmtx
libdrm
libdv
libdvbpsi
libdvdcss
libdvdnav
libdvdread
libe-book
libebml
libebur128
libedit
libelf
libepoxy
libepubgen
libetonyek
libev
libevdev
libevent
libexttextcat
libfakekey
libfdk-aac
libffi
libfontenc
libfreeaptx
libfreehand
libgcrypt
libglvnd
libgme
libgpg-error
libgsf
libgudev
libhandy
libibus
libical
libice
libid3tag
libidn
libidn2
libiec61883
libimobiledevice
libinih
libinput
libinstpatch
libisl
libixion
libjpeg-turbo
libkate
libkcddb
libkcompactdisc
libkdcraw
libkexiv2
libkeybinder3
libkipi
libksba
libkscreen
libksysguard
libktorrent
liblangtag
libldac
libldap
liblqr
liblrdf
libltc
libmad
libmanette
libmatroska
libmaxminddb
libmbim
libmd
libmfx
libmicrodns
libmm-glib
libmnl
libmodplug
libmpc
libmpcdec
libmpdclient
libmpeg2
libmspub
libmtp
libmusicbrainz5
libmwaw
libndp
libnetfilter_conntrack
libnewt
libnfnetlink
libnftnl
libnghttp2
libnice
libnl
libnm
libnotify
libnsl
libnumbertext
libodfgen
libogg
libomxil-bellagio
libopenmpt
libopenraw
liborcus
libp11-kit
libpagemaker
libpaper
libpcap
libpciaccess
libpgm
libpipeline
libplacebo
libplist
libpng
libproxy
libpsl
libpulse
libpwquality
libqaccessibilityclient
libqalculate
libqmi
libqrtr-glib
libqxp
libraqm
libraw
libraw1394
libreoffice-fresh
librevenge
librsvg
libsamplerate
libsasl
libseccomp
libsecret
libsidplay
libsigc++
libsm
libsndfile
libsodium
libsoup
libsoup3
libsoxr
libspectre
libsrtp
libssh
libssh2
libstaroffice
libstemmer
libsysprof-capture
libtar
libtasn1
libteam
libthai
libtheora
libtiff
libtirpc
libtommath
libtool
libunistring
libunwind
libupnp
liburcu
libusb
libusbmuxd
libutempter
libuv
libva
libvdpau
libvisio
libvisual
libvorbis
libvpx
libwacom
libwebp
libwnck3
libwpd
libwpe
libwpg
libwps
libx11
libx86emu
libxau
libxaw
libxcb
libxcomposite
libxcrypt
libxcursor
libxcvt
libxdamage
libxdg-basedir
libxdmcp
libxext
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxml2
libxmlb
libxmu
libxpm
libxrandr
libxrender
libxres
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxxf86vm
libyaml
libzip
libzmf
licenses
lilv
linux
linux-api-headers
linux-atm
linux-firmware
linux-firmware-whence
linux-headers
llvm-libs
lm_sensors
lmdb
logrotate
lpsolve
lsb-release
lsscsi
lua52
lua53
luit
lv2
lvm2
lxappearance
lz4
lzo
m4
mailcap
make
man-db
man-pages
mbedtls
md4c
mdadm
media-player-info
meld
mesa
mesa-utils
milou
minizip
mjpegtools
mkinitcpio
mkinitcpio-busybox
mkinitcpio-nfs-utils
mkinitcpio-openswap
mlocate
mlt
mobile-broadband-provider-info
modemmanager
modemmanager-qt
mpfr
mpg123
mtdev
mtools
nbd
ncurses
ndctl
ndisc6
neofetch
neon
netctl
nettle
networkmanager
networkmanager-openvpn
networkmanager-qt
nfs-utils
nfsidmap
nilfs-utils
nitrogen
nmap
node-gyp
nodejs-lts-erbium
nodejs-nopt
noto-fonts
npm
npth
nspr
nss
nss-mdns
ntfs-3g
ntp
nvidia-dkms
nvidia-installer-common
nvidia-installer-db
nvidia-installer-dkms
nvidia-utils
obs-studio
okular
oniguruma
openal
opencolorio
openconnect
opencore-amr
opendesktop-fonts
opendoas
openexr
openjpeg2
openmpi
openresolv
openssh
openssl
openvpn
opus
orc
os-prober
ostree
p11-kit
pacman
pacman-contrib
pacman-mirrorlist
pacutils
pahole
pam
pambase
pango
pangomm
parallel
parted
patch
pavucontrol
pciutils
pcre
pcre2
pcsclite
pcurses
peaclock
perl
perl-clone
perl-encode-locale
perl-error
perl-file-listing
perl-html-parser
perl-html-tagset
perl-http-cookies
perl-http-daemon
perl-http-date
perl-http-message
perl-http-negotiate
perl-io-html
perl-libwww
perl-lwp-mediatypes
perl-mailtools
perl-net-http
perl-timedate
perl-try-tiny
perl-uri
perl-www-robotrules
perl-xml-parser
perl-xml-writer
phonon-qt5
phonon-qt5-gstreamer
picom
pinentry
pipewire
pipewire-alsa
pipewire-jack
pipewire-media-session
pipewire-pulse
pixman
pkcs11-helper
pkgconf
pkgfile
plasma-desktop
plasma-disks
plasma-framework
plasma-integration
plasma-nm
plasma-pa
plasma-workspace
playerctl
polkit
polkit-kde-agent
polkit-qt5
polybar
poppler
poppler-glib
poppler-qt5
popt
portaudio
portsmf
power-profiles-daemon
powerdevil
ppp
pptpclient
print-manager
prison
procps-ng
psmisc
pulseaudio-qt
purpose
pv
pystring
python
python-cairo
python-colorama
python-defusedxml
python-distutils-extra
python-dnspython
python-future
python-gobject
python-importlib-metadata
python-markdown
python-packaging
python-ply
python-psutil
python-pyparsing
python-pyxdg
python-shtab
python-six
python-termcolor
python-zipp
python2
qca-qt5
qqc2-desktop-style
qrencode
qt5-base
qt5-declarative
qt5-graphicaleffects
qt5-location
qt5-multimedia
qt5-networkauth
qt5-quickcontrols
qt5-quickcontrols2
qt5-sensors
qt5-speech
qt5-svg
qt5-tools
qt5-translations
qt5-wayland
qt5-webchannel
qt5-webengine
qt5-x11extras
qt5ct
qt6-base
qt6-declarative
qt6-translations
quazip-qt5
ranger
raptor
rasqal
rav1e
re2
readline
rebuild-detector
redland
reflector
reflector-simple
reiserfsprogs
rest
rhash
rnnoise
rofi
rp-pppoe
rpcbind
rsync
rtkit
rtmpdump
run-parts
s-nail
sbc
sddm
sddm-kcm
sdl
sdl2
sed
semver
serd
sg3_utils
shaderc
shadow
shared-mime-info
signon-kwallet-extension
signon-plugin-oauth2
signon-ui
signond
slang
smartmontools
smbclient
snappy
socat
sof-firmware
solid
sonnet
sord
sound-theme-freedesktop
soundtouch
spandsp
spectacle
speex
speexdsp
spirv-tools
sqlite
sratom
srt
sshfs
startup-notification
stoken
sudo
suil
svt-av1
svt-hevc
syndication
syntax-highlighting
sysfsutils
systemd
systemd-libs
systemd-sysvcompat
systemsettings
taglib
talloc
tar
tcl
tdb
tevent
texinfo
thin-provisioning-tools
threadweaver
tinyxml
tldr
tpm2-tss
tracker3
tslib
ttf-bitstream-vera
ttf-dejavu
ttf-hack
ttf-liberation
ttf-opensans
twolame
tzdata
udisks2
unrar
unzip
upower
usb_modeswitch
usbmuxd
usbutils
util-linux
util-linux-libs
v4l-utils
vamp-plugin-sdk
vid.stab
vim
vim-runtime
virtualbox
virtualbox-host-modules-arch
vlc
vmaf
volume_key
vpnc
vulkan-headers
vulkan-icd-loader
vulkan-tools
wayland
wayland-protocols
wayland-utils
webkit2gtk
webrtc-audio-processing
welcome
wget
which
whois
wildmidi
wireless-regdb
wireless_tools
woff2
wpa_supplicant
wpebackend-fdo
wxgtk-common
wxgtk3
x264
x265
xbitmaps
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xcb-util-xrm
xdg-dbus-proxy
xdg-desktop-portal
xdg-desktop-portal-gnome
xdg-desktop-portal-gtk
xdg-user-dirs
xdg-utils
xf86-input-libinput
xfsprogs
xkeyboard-config
xl2tpd
xmlsec
xorg-fonts-encodings
xorg-server
xorg-server-common
xorg-setxkbmap
xorg-xauth
xorg-xdpyinfo
xorg-xinit
xorg-xinput
xorg-xkbcomp
xorg-xkill
xorg-xmessage
xorg-xmodmap
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xset
xorg-xsetroot
xorgproto
xsettingsd
xterm
xvidcore
xxhash
xz
yajl
yaml-cpp
yay
zbar
zeromq
zimg
zlib
zstd
zvbi
zxing-cpp
