i3-gaps
kitty
dmenu
rofi
polybar
nitrogen
lxappearance
picom
dunst
xorg
nautilus
eog
gedit
gnome-software
gnome-disks
gdm
libreoffice
firefox
flatpak
adwaita-icon-theme
